import random,sys,time,os,pyfiglet
from bs4 import BeautifulSoup as BS
from time import sleep
import requests

print ('\033[1;95mWelcome')
sleep (1)
print ()
print ('\033[1;92mclick on this link to get password👇')
#sleep (0.1)
print ()
link="\033[1;93m https://miklpro.com/scs4Je"
print (link)
#sleep (1)
print ()
password=input ('\033[1;92m》Enter Password Script :  \033[1;96m')
sleep (1)

"""rrr=requests.get('https://pastelink.net/vsngvbe8').text
soup=BS(rrr,'html.parser')
lxc=(soup.find('div',{'class':'body-display'})).text"""

if password=='Abdullah0912': #in lxc:
    print ()
    print ('\033[1;96m》True Password《')
    sleep (1)
else:
    print ()
    print ('\033[1;91mError Password')
    exit()

print ()
nn='''\033[1;92m××××××××××××××××××××××××××××××××××××××××××××

######## Welcome To Abdullah Script #######

########## Script Send Spam Calls ########

####### Projected By Abdullah Salah #####'''
for I in nn+'\n':

	sys.stdout.write (I)
	sys.stdout.flush ()
	time.sleep (00.040)
print ()


logo6='''\033[;092m
░██████╗██████╗░░█████╗░███╗░░░███╗
██╔════╝██╔══██╗██╔══██╗████╗░████║
╚█████╗░██████╔╝███████║██╔████╔██║
░╚═══██╗██╔═══╝░██╔══██║██║╚██╔╝██║
██████╔╝██║░░░░░██║░░██║██║░╚═╝░██║
╚═════╝░╚═╝░░░░░╚═╝░░╚═╝╚═╝░░░░░╚═╝

░█████╗░░█████╗░██╗░░░░░██╗░░░░░  ██╗░░░██╗██████╗░
██╔══██╗██╔══██╗██║░░░░░██║░░░░░  ██║░░░██║╚════██╗
██║░░╚═╝███████║██║░░░░░██║░░░░░  ╚██╗░██╔╝░░███╔═╝
██║░░██╗██╔══██║██║░░░░░██║░░░░░  ░╚████╔╝░██╔══╝░░
╚█████╔╝██║░░██║███████╗███████╗  ░░╚██╔╝░░███████╗
░╚════╝░╚═╝░░╚═╝╚══════╝╚══════╝  ░░░╚═╝░░░╚══════╝


██████╗░██╗░░░██╗
██╔══██╗╚██╗░██╔╝
██████╦╝░╚████╔╝░
██╔══██╗░░╚██╔╝░░
██████╦╝░░░██║░░░
╚═════╝░░░░╚═╝░░░

░█████╗░██████╗░██████╗░██╗░░░██╗██╗░░░░░██╗░░░░░
██╔══██╗██╔══██╗██╔══██╗██║░░░██║██║░░░░░██║░░░░░
███████║██████╦╝██║░░██║██║░░░██║██║░░░░░██║░░░░░
██╔══██║██╔══██╗██║░░██║██║░░░██║██║░░░░░██║░░░░░
██║░░██║██████╦╝██████╔╝╚██████╔╝███████╗███████╗
╚═╝░░╚═╝╚═════╝░╚═════╝░░╚═════╝░╚══════╝╚══════╝
'''

for I in logo6 +'\n':
	sys.stdout.write (I)
	sys.stdout.flush ()
	time.sleep (00.0010)

i='''\033[1;092m Telegram channel : 

 http://t.me/Techno0099        

Youttube channel  : 

 https://youtube.com/channel/UCAbtkFAe9yyX0HJNFXyKJUg 

Facebook:

 https://www.facebook.com/AbdullahSalah0099/
'''
for I in i +'\n':
	sys.stdout.write (I)
	sys.stdout.flush ()
	time.sleep (00.0050)
print ()
print ("\033[1;093m*"*60)
print()
num=input ('\033[1;92m》Enter Phone Number : ')

.....
